/* Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3

Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22

Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет

Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

5 -> 2, 4
8 -> 2, 4, 6, 8



// comment

Console.WriteLine("what");

Console.ReadLine();

string A = "text";

int B = 0;

double C = 15;

int D = Convert.ToInt32(Console.ReadLine());

if (B > C)
{
    Console.WriteLine("kuku");
}

Console.WriteLine("input some text: ");

string T = Console.ReadLine();


//переводим текст в цифру:
//создали цифровую переменную:

int Digit;

//конвертировали текст в цифру:

Digit = Convert.ToInt32(T);


int DigitPlus = Convert.ToInt32(Console.ReadLine());

if (B < C)
{
    B +=1;
}
else
{
    B -=1;
}

if (B < C)
{
    B +=1;
}

else
{
    B -=1;
}

while (B < C)
{
    B +=1:
}

Console.WriteLine( "finish");

while (B < C)
{
    if (B < C)
    {
         B +=1;
    }

    else
    {
        B -=1;
    }
    
    B +=1;
}

Console.WriteLine("finish");
*/